# Import statements:

In [90]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd
from sklearn import preprocessing
import numpy as np
import pandas_profiling

# Get Data from DB
1. Get the data from the mysql database. 
2. Store it in dataframe 'credit'.

In [91]:
db_connection_str = 'mysql+pymysql://deepanalytics:Sqltask1234!@34.73.222.197/deepanalytics'
db_connection = create_engine(db_connection_str)

In [92]:
credit = pd.read_sql('SELECT * FROM credit', con=db_connection)

# Verify Data
1. check with 'head'

In [93]:
credit.head()

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default

# Clean and Inspect Data
drop duplicates, rename columns, drop any columns and rows that don't have usable values.

In [94]:
#drop duplicates
credit = credit.drop_duplicates()

#rename columns to the default names so we can understand them
credit.columns = credit.iloc[0]

#drop first row, which contains text column names
credit = credit.drop(credit.index[0])

In [95]:
#check the sex & education text values for errors
print(credit.SEX.unique())
print(credit.EDUCATION.unique())

['female' 'male' 'X2']
['university' 'graduate school' 'high school' 'other' 'X3']

In [96]:
#'X3' doesn't belong. Check that row.
print(credit['SEX'].value_counts())

#confirm that the row in question doesn't have useful data in it
print(credit[credit.SEX == 'X2'])

female    18112
male      11888
X2            1
Name: SEX, dtype: int64
0   ID LIMIT_BAL SEX EDUCATION MARRIAGE AGE PAY_0 PAY_2 PAY_3 PAY_4  ...  \
202           X1  X2        X3       X4  X5    X6    X7    X8    X9  ...

0   BILL_AMT4 BILL_AMT5 BILL_AMT6 PAY_AMT1 PAY_AMT2 PAY_AMT3 PAY_AMT4  \
202       X15       X16       X17      X18      X19      X20      X21

0   PAY_AMT5 PAY_AMT6 default payment next month
202      X22      X23                          Y

[1 rows x 25 columns]

In [97]:
#only one row has the column titles in it. drop it from the dataframe.
credit = credit[credit.SEX != 'X2']

#confirm the column is good.
print(credit['SEX'].unique())

['female' 'male']

In [98]:
#check the other attributes for weird values

for column in credit.columns:
    print(column + ":")
    print(credit[column].unique())
    print("\n")

ID:
['1' '2' '3' ... '29998' '29999' '30000']


LIMIT_BAL:
['20000' '120000' '90000' '50000' '500000' '100000' '140000' '200000'
 '260000' '630000' '70000' '250000' '320000' '360000' '180000' '130000'
 '450000' '60000' '230000' '160000' '280000' '10000' '40000' '210000'
 '150000' '380000' '310000' '400000' '80000' '290000' '340000' '300000'
 '30000' '240000' '470000' '480000' '350000' '330000' '110000' '420000'
 '170000' '370000' '270000' '220000' '190000' '510000' '460000' '440000'
 '410000' '490000' '390000' '580000' '600000' '620000' '610000' '700000'
 '670000' '680000' '430000' '550000' '540000' '1000000' '530000' '710000'
 '560000' '520000' '750000' '640000' '16000' '570000' '590000' '660000'
 '720000' '327680' '740000' '800000' '760000' '690000' '650000' '780000'
 '730000']


SEX:
['female' 'male']


EDUCATION:
['university' 'graduate school' 'high school' 'other']


MARRIAGE:
['1' '2' '3' '0']


AGE:
['24' '26' '34' '37' '57' '29' '23' '28' '35' '51' '41' '30' '49' '39'
 '40' '27' '47' '33' '32' '54' '58' '22' '25' '31' '46' '42' '43' '45'
 '56' '44' '53' '38' '63' '36' '52' '48' '55' '60' '50' '75' '61' '73'
 '59' '21' '67' '66' '62' '70' '72' '64' '65' '71' '69' '68' '79' '74']


PAY_0:
['2' '-1' '0' '-2' '1' '3' '4' '8' '7' '5' '6']


PAY_2:
['2' '0' '-1' '-2' '3' '5' '7' '4' '1' '6' '8']


PAY_3:
['-1' '0' '2' '-2' '3' '4' '6' '7' '1' '5' '8']


PAY_4:
['-1' '0' '-2' '2' '3' '4' '5' '7' '6' '1' '8']


PAY_5:
['-2' '0' '-1' '2' '3' '5' '4' '7' '8' '6']


PAY_6:
['-2' '2' '0' '-1' '3' '6' '4' '7' '8' '5']


BILL_AMT1:
['3913' '2682' '29239' ... '1683' '-1645' '47929']


BILL_AMT2:
['3102' '1725' '14027' ... '3356' '78379' '48905']


BILL_AMT3:
['689' '2682' '13559' ... '2758' '76304' '49764']


BILL_AMT4:
['0' '3272' '14331' ... '20878' '52774' '36535']


BILL_AMT5:
['0' '3455' '14948' ... '31237' '5190' '32428']


BILL_AMT6:
['0' '3261' '15549' ... '19357' '48944' '15313']


PAY_AMT1:
['0' '1518' '2000' ... '10029' '9054' '85900']


PAY_AMT2:
['689' '1000' '1500' ... '2977' '111784' '3526']


PAY_AMT3:
['0' '1000' '1200' ... '349395' '8907' '25128']


PAY_AMT4:
['0' '1000' '1100' ... '2556' '10115' '8049']


PAY_AMT5:
['0' '1000' '1069' ... '8040' '3319' '52964']


PAY_AMT6:
['0' '2000' '5000' ... '70052' '220076' '16080']


default payment next month:
['default' 'not default']

### Convert the data types of each attribute to numeric
Check the datatypes:

In [99]:
credit.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30000 entries, 1 to 30203
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  object
 1   LIMIT_BAL                   30000 non-null  object
 2   SEX                         30000 non-null  object
 3   EDUCATION                   30000 non-null  object
 4   MARRIAGE                    30000 non-null  object
 5   AGE                         30000 non-null  object
 6   PAY_0                       30000 non-null  object
 7   PAY_2                       30000 non-null  object
 8   PAY_3                       30000 non-null  object
 9   PAY_4                       30000 non-null  object
 10  PAY_5                       30000 non-null  object
 11  PAY_6                       30000 non-null  object
 12  BILL_AMT1                   30000 non-null  object
 13  BILL_AMT2                   30000 non-null  object
 14  BILL_AMT3                   30000 non-null  object
 15  BILL_AMT4                   30000 non-null  object
 16  BILL_AMT5                   30000 non-null  object
 17  BILL_AMT6                   30000 non-null  object
 18  PAY_AMT1                    30000 non-null  object
 19  PAY_AMT2                    30000 non-null  object
 20  PAY_AMT3                    30000 non-null  object
 21  PAY_AMT4                    30000 non-null  object
 22  PAY_AMT5                    30000 non-null  object
 23  PAY_AMT6                    30000 non-null  object
 24  default payment next month  30000 non-null  object
dtypes: object(25)
memory usage: 6.0+ MB

The datatype for each of these columns is 'object'. Make them numeric:
1. one-hot encode SEX and EDUCATION columns using get_dummies.
2. store the new variables in brand new columns -- don't mess with existing data.
3. name the new columns with identifiable prefixes
4. check results

In [100]:
s_dummies = pd.get_dummies(credit['SEX'], prefix='SEX')
credit = pd.concat([credit, s_dummies], axis=1)

edu_dummies = pd.get_dummies(credit['EDUCATION'], prefix='EDU')
credit = pd.concat([credit, edu_dummies], axis=1)

credit.head(10)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month,sex_female,sex_male,edu_graduate school,edu_high school,edu_other,edu_university
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,default,1,0,0,0,0,1
2,2,120000,female,university,2,26,-1,2,0,0,...,1000,0,2000,default,1,0,0,0,0,1
3,3,90000,female,university,2,34,0,0,0,0,...,1000,1000,5000,not default,1,0,0,0,0,1
4,4,50000,female,university,1,37,0,0,0,0,...,1100,1069,1000,not default,1,0,0,0,0,1
5,5,50000,male,university,1,57,-1,0,-1,0,...,9000,689,679,not default,0,1,0,0,0,1
6,6,50000,male,graduate school,2,37,0,0,0,0,...,1000,1000,800,not default,0,1,1,0,0,0
7,7,500000,male,graduate school,2,29,0,0,0,0,...,20239,13750,13770,not default,0,1,1,0,0,0
8,8,100000,female,university,2,23,0,-1,-1,0,...,581,1687,1542,not default,1,0,0,0,0,1
9,9,140000,female,high school,1,28,0,0,2,0,...,1000,1000,1000,not default,1,0,0,1,0,0
10,10,20000,male,high school,2,35,-2,-2,-2,-2,...,13007,1122,0,not default,0,1,0,1,0,0

the one-hot encoding was successful, we can remove sex and education columns from the dataframe.

In [101]:
credit.drop(['SEX'], axis=1, inplace=True)
credit.drop(['EDUCATION'], axis=1, inplace=True)

credit.head(10)

,ID,LIMIT_BAL,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,...,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month,sex_female,sex_male,edu_graduate school,edu_high school,edu_other,edu_university
1,1,20000,1,24,2,2,-1,-1,-2,-2,...,0,0,0,default,1,0,0,0,0,1
2,2,120000,2,26,-1,2,0,0,0,2,...,1000,0,2000,default,1,0,0,0,0,1
3,3,90000,2,34,0,0,0,0,0,0,...,1000,1000,5000,not default,1,0,0,0,0,1
4,4,50000,1,37,0,0,0,0,0,0,...,1100,1069,1000,not default,1,0,0,0,0,1
5,5,50000,1,57,-1,0,-1,0,0,0,...,9000,689,679,not default,0,1,0,0,0,1
6,6,50000,2,37,0,0,0,0,0,0,...,1000,1000,800,not default,0,1,1,0,0,0
7,7,500000,2,29,0,0,0,0,0,0,...,20239,13750,13770,not default,0,1,1,0,0,0
8,8,100000,2,23,0,-1,-1,0,0,-1,...,581,1687,1542,not default,1,0,0,0,0,1
9,9,140000,1,28,0,0,2,0,0,0,...,1000,1000,1000,not default,1,0,0,1,0,0
10,10,20000,2,35,-2,-2,-2,-2,-1,-1,...,13007,1122,0,not default,0,1,0,1,0,0

The default payment next month column is also text, let's one hot encode it.
1. select and label encode the y column
2. check transformation, if good proceed
3. one hot encode the label-encoded y-column.
4. verify transformation.

In [102]:
sle = preprocessing.LabelEncoder()
credit['default payment next month'] = sle.fit_transform(credit['default payment next month'])

#check transformation
credit.info()
credit.head(10)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30000 entries, 1 to 30203
Data columns (total 29 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  object
 1   LIMIT_BAL                   30000 non-null  object
 2   MARRIAGE                    30000 non-null  object
 3   AGE                         30000 non-null  object
 4   PAY_0                       30000 non-null  object
 5   PAY_2                       30000 non-null  object
 6   PAY_3                       30000 non-null  object
 7   PAY_4                       30000 non-null  object
 8   PAY_5                       30000 non-null  object
 9   PAY_6                       30000 non-null  object
 10  BILL_AMT1                   30000 non-null  object
 11  BILL_AMT2                   30000 non-null  object
 12  BILL_AMT3                   30000 non-null  object
 13  BILL_AMT4                   30000 non-null  object
 14  BILL_AMT5                   30000 non-null  object
 15  BILL_AMT6                   30000 non-null  object
 16  PAY_AMT1                    30000 non-null  object
 17  PAY_AMT2                    30000 non-null  object
 18  PAY_AMT3                    30000 non-null  object
 19  PAY_AMT4                    30000 non-null  object
 20  PAY_AMT5                    30000 non-null  object
 21  PAY_AMT6                    30000 non-null  object
 22  default payment next month  30000 non-null  int32
 23  sex_female                  30000 non-null  uint8
 24  sex_male                    30000 non-null  uint8
 25  edu_graduate school         30000 non-null  uint8
 26  edu_high school             30000 non-null  uint8
 27  edu_other                   30000 non-null  uint8
 28  edu_university              30000 non-null  uint8
dtypes: int32(1), object(22), uint8(6)
memory usage: 5.6+ MB

,ID,LIMIT_BAL,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,...,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month,sex_female,sex_male,edu_graduate school,edu_high school,edu_other,edu_university
1,1,20000,1,24,2,2,-1,-1,-2,-2,...,0,0,0,0,1,0,0,0,0,1
2,2,120000,2,26,-1,2,0,0,0,2,...,1000,0,2000,0,1,0,0,0,0,1
3,3,90000,2,34,0,0,0,0,0,0,...,1000,1000,5000,1,1,0,0,0,0,1
4,4,50000,1,37,0,0,0,0,0,0,...,1100,1069,1000,1,1,0,0,0,0,1
5,5,50000,1,57,-1,0,-1,0,0,0,...,9000,689,679,1,0,1,0,0,0,1
6,6,50000,2,37,0,0,0,0,0,0,...,1000,1000,800,1,0,1,1,0,0,0
7,7,500000,2,29,0,0,0,0,0,0,...,20239,13750,13770,1,0,1,1,0,0,0
8,8,100000,2,23,0,-1,-1,0,0,-1,...,581,1687,1542,1,1,0,0,0,0,1
9,9,140000,1,28,0,0,2,0,0,0,...,1000,1000,1000,1,1,0,0,1,0,0
10,10,20000,2,35,-2,-2,-2,-2,-1,-1,...,13007,1122,0,1,0,1,0,1,0,0

In [103]:
#one hot encode the label encoded y column

default_dummies = pd.get_dummies(credit['default payment next month'], prefix='default')
credit = pd.concat([credit, default_dummies], axis=1)

#verify transformation

credit.head(10)

,ID,LIMIT_BAL,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,...,PAY_AMT6,default payment next month,sex_female,sex_male,edu_graduate school,edu_high school,edu_other,edu_university,default_0,default_1
1,1,20000,1,24,2,2,-1,-1,-2,-2,...,0,0,1,0,0,0,0,1,1,0
2,2,120000,2,26,-1,2,0,0,0,2,...,2000,0,1,0,0,0,0,1,1,0
3,3,90000,2,34,0,0,0,0,0,0,...,5000,1,1,0,0,0,0,1,0,1
4,4,50000,1,37,0,0,0,0,0,0,...,1000,1,1,0,0,0,0,1,0,1
5,5,50000,1,57,-1,0,-1,0,0,0,...,679,1,0,1,0,0,0,1,0,1
6,6,50000,2,37,0,0,0,0,0,0,...,800,1,0,1,1,0,0,0,0,1
7,7,500000,2,29,0,0,0,0,0,0,...,13770,1,0,1,1,0,0,0,0,1
8,8,100000,2,23,0,-1,-1,0,0,-1,...,1542,1,1,0,0,0,0,1,0,1
9,9,140000,1,28,0,0,2,0,0,0,...,1000,1,1,0,0,1,0,0,0,1
10,10,20000,2,35,-2,-2,-2,-2,-1,-1,...,0,1,0,1,0,1,0,0,0,1

In [104]:
# drop the 'default payment next month' column.
credit.drop(['default payment next month'], axis=1, inplace=True)

### Rename features to custom names.
The feature names are also still not descriptive enough, rename them so that I can understand them.

In [105]:
#give the features better names
credit.rename(columns = {'PAY_0':'PAY_STAT_SEP', 'PAY_2':'PAY_STAT_AUG', 'PAY_3':'PAY_STAT_JUL', 
                    'PAY_4':'PAY_STAT_JUN', 'PAY_5':'PAY_STAT_MAY', 'PAY_6':'PAY_STAT_APR'}, inplace = True)
credit.rename(columns = {'BILL_AMT1':'BILL_AMT_SEP', 'BILL_AMT2':'BILL_AMT_AUG', 'BILL_AMT3':'BILL_AMT_JUL',
                    'BILL_AMT4':'BILL_AMT_JUN', 'BILL_AMT5':'BILL_AMT_MAY', 'BILL_AMT6':'BILL_AMT_APR'}, inplace = True)
credit.rename(columns = {'PAY_AMT1':'PAY_AMT_SEP','PAY_AMT2':'PAY_AMT_AUG', 'PAY_AMT3':'PAY_AMT_JUL',
                     'PAY_AMT4':'PAY_AMT_JUN', 'PAY_AMT5':'PAY_AMT_MAY', 'PAY_AMT6':'PAY_AMT_APR'}, inplace = True)
credit.rename(columns = {'default_0':'defaulted', 'default_1':'did_not_default'}, inplace = True)
credit.columns

Index(['ID', 'LIMIT_BAL', 'MARRIAGE', 'AGE', 'PAY_STAT_SEP', 'PAY_STAT_AUG',
       'PAY_STAT_JUL', 'PAY_STAT_JUN', 'PAY_STAT_MAY', 'PAY_STAT_APR',
       'BILL_AMTSEP', 'BILL_AMTAUG', 'BILL_AMTJUL', 'BILL_AMTJUN',
       'BILL_AMTMAY', 'BILL_AMTAPR', 'PAY_AMTSEP', 'PAY_AMTAUG', 'PAY_AMTJUL',
       'PAY_AMTJUN', 'PAY_AMTMAY', 'PAY_AMTAPR', 'sex_female', 'sex_male',
       'edu_graduate school', 'edu_high school', 'edu_other', 'edu_university',
       'defaulted', 'did_not_default'],
      dtype='object')

### Convert remaining features to numeric types.

In [106]:
#make an array for all column names so we can iterate through them
feats = credit.columns

#try to force all of the object columns to be numeric
for feat in feats:
    try:
        credit[feat] = pd.to_numeric(credit[feat])
    except:
        print("{} could not be converted to numeric.\n".format(feat))

Nothing printed, so all of those attributes were converted without errors. Put them back in the dataframe.

In [107]:
#verify datatypes were changed
print(credit.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30000 entries, 1 to 30203
Data columns (total 30 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   30000 non-null  int64
 1   LIMIT_BAL            30000 non-null  int64
 2   MARRIAGE             30000 non-null  int64
 3   AGE                  30000 non-null  int64
 4   PAY_STAT_SEP         30000 non-null  int64
 5   PAY_STAT_AUG         30000 non-null  int64
 6   PAY_STAT_JUL         30000 non-null  int64
 7   PAY_STAT_JUN         30000 non-null  int64
 8   PAY_STAT_MAY         30000 non-null  int64
 9   PAY_STAT_APR         30000 non-null  int64
 10  BILL_AMTSEP          30000 non-null  int64
 11  BILL_AMTAUG          30000 non-null  int64
 12  BILL_AMTJUL          30000 non-null  int64
 13  BILL_AMTJUN          30000 non-null  int64
 14  BILL_AMTMAY          30000 non-null  int64
 15  BILL_AMTAPR          30000 non-null  int64
 16  PAY_AMTSEP           30000 non-null  int64
 17  PAY_AMTAUG           30000 non-null  int64
 18  PAY_AMTJUL           30000 non-null  int64
 19  PAY_AMTJUN           30000 non-null  int64
 20  PAY_AMTMAY           30000 non-null  int64
 21  PAY_AMTAPR           30000 non-null  int64
 22  sex_female           30000 non-null  uint8
 23  sex_male             30000 non-null  uint8
 24  edu_graduate school  30000 non-null  uint8
 25  edu_high school      30000 non-null  uint8
 26  edu_other            30000 non-null  uint8
 27  edu_university       30000 non-null  uint8
 28  defaulted            30000 non-null  uint8
 29  did_not_default      30000 non-null  uint8
dtypes: int64(22), uint8(8)
memory usage: 5.5 MB
None

In [108]:
credit.describe()

,ID,LIMIT_BAL,MARRIAGE,AGE,PAY_STAT_SEP,PAY_STAT_AUG,PAY_STAT_JUL,PAY_STAT_JUN,PAY_STAT_MAY,PAY_STAT_APR,...,PAY_AMTMAY,PAY_AMTAPR,sex_female,sex_male,edu_graduate school,edu_high school,edu_other,edu_university,defaulted,did_not_default
count,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,...,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000
mean,15000.500000,167484.322667,1.551867,35.485500,-0.016700,-0.133767,-0.166200,-0.220667,-0.266200,-0.291100,...,4799.387633,5215.502567,0.603733,0.396267,0.352833,0.163900,0.015600,0.467667,0.221200,0.778800
std,8660.398374,129747.661567,0.521970,9.217904,1.123802,1.197186,1.196868,1.169139,1.133187,1.149988,...,15278.305679,17777.465775,0.489129,0.489129,0.477859,0.370191,0.123924,0.498962,0.415062,0.415062
min,1.000000,10000.000000,0.000000,21.000000,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,7500.750000,50000.000000,1.000000,28.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,...,252.500000,117.750000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
50%,15000.500000,140000.000000,2.000000,34.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,1500.000000,1500.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
75%,22500.250000,240000.000000,2.000000,41.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,4031.500000,4000.000000,1.000000,1.000000,1.000000,0.000000,0.000000,1.000000,0.000000,1.000000
max,30000.000000,1000000.000000,3.000000,79.000000,8.000000,8.000000,8.000000,8.000000,8.000000,8.000000,...,426529.000000,528666.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000